Repository: Mattot/sports-tracker-demo
Catalog: Modules/SportRecord/Sources/SportRecord/Resources/Localizable.xcstrings
Source language: en
Languages: cs, sk

# addRecord.location.placeholder
source: Location
cs: Místo
sk: Miesto

# addRecord.name.placeholder
source: Name
cs: Název
sk: Názov

# addRecord.saveError.local
source: Couldn't save locally. Please try again.
cs: Nepodařilo se uložit lokálně. Zkuste to prosím znovu.
sk: Nepodarilo sa uložiť lokálne. Skúste to prosím znova.

# addRecord.saveError.remote
source: Couldn't save to the backend. You may be offline — check your connection and try again.
cs: Nepodařilo se uložit na server. Možná jste offline — zkontrolujte připojení a zkuste to znovu.
sk: Nepodarilo sa uložiť na server. Možno ste offline — skontrolujte pripojenie a skúste to znova.

# addRecord.saveError.title
source: Couldn't Save
cs: Nepodařilo se uložit
sk: Nepodarilo sa uložiť

# addRecord.section.activity
source: Activity
cs: Aktivita
sk: Aktivita

# addRecord.section.duration
source: Duration
cs: Doba trvání
sk: Trvanie

# addRecord.section.storage
source: Storage
cs: Úložiště
sk: Úložisko

# addRecord.storage.picker
source: Select storage
cs: Vyberte úložiště
sk: Vyberte úložisko

# addRecord.title
source: Add Record
cs: Přidat záznam
sk: Pridať záznam

# common.cancel
source: Cancel
cs: Zrušit
sk: Zrušiť

# common.delete
source: Delete
cs: Smazat
sk: Odstrániť

# common.done
source: Done
cs: Hotovo
sk: Hotovo

# common.edit
source: Edit
cs: Upravit
sk: Upraviť

# common.save
source: Save
cs: Uložit
sk: Uložiť

# common.tryAgain
source: Try Again
cs: Zkusit znovu
sk: Skúsiť znova

# filter.all
source: All
cs: Všechny
sk: Všetky

# filter.local
source: Local
cs: Lokální
sk: Lokálne

# filter.remote
source: Remote
cs: Vzdálené
sk: Vzdialené

# list.add.button
source: Add Record
cs: Přidat záznam
sk: Pridať záznam

# list.banner.offline
source: You're offline — showing local records.
cs: Jste offline — zobrazují se lokální záznamy.
sk: Ste offline — zobrazujú sa lokálne záznamy.

# list.banner.remoteUnavailable
source: Couldn't reach remote — showing local records.
cs: Vzdálené úložiště není dostupné — zobrazují se lokální záznamy.
sk: Vzdialené úložisko nie je dostupné — zobrazujú sa lokálne záznamy.

# list.deleteConfirm.title %lld
source: Delete %lld records?
cs: Smazat %lld záznamů?
sk: Odstrániť %lld záznamov?

# list.deleteError.both
source: Couldn't delete some records. Check your connection and try again.
cs: Některé záznamy se nepodařilo smazat. Zkontrolujte připojení a zkuste to znovu.
sk: Niektoré záznamy sa nepodarilo odstrániť. Skontrolujte pripojenie a skúste to znova.

# list.deleteError.local
source: Couldn't delete local records. Please try again.
cs: Lokální záznamy se nepodařilo smazat. Zkuste to prosím znovu.
sk: Lokálne záznamy sa nepodarilo odstrániť. Skúste to prosím znova.

# list.deleteError.remote
source: Couldn't delete remote records. You may be offline.
cs: Vzdálené záznamy se nepodařilo smazat. Možná jste offline.
sk: Vzdialené záznamy sa nepodarilo odstrániť. Možno ste offline.

# list.deleteError.title
source: Delete failed
cs: Smazání se nezdařilo
sk: Odstránenie zlyhalo

# list.deleteError.unknown
source: Couldn't delete records.
cs: Záznamy se nepodařilo smazat.
sk: Záznamy sa nepodarilo odstrániť.

# list.deleteSelection.button
source: Delete Records (%lld)
cs: Smazat záznamy (%lld)
sk: Odstrániť záznamy (%lld)

# list.empty.filtered.message
source: You have no %@ records yet.
cs: Zatím nemáte žádné %@ záznamy.
sk: Zatiaľ nemáte žiadne %@ záznamy.

# list.empty.filtered.title
source: No %@ Records
cs: Žádné %@ záznamy
sk: Žiadne %@ záznamy

# list.empty.message
source: Add your first activity to see it here.
cs: Přidejte svou první aktivitu a zobrazí se zde.
sk: Pridajte svoju prvú aktivitu a zobrazí sa tu.

# list.empty.title
source: No Sport Records
cs: Žádné sportovní záznamy
sk: Žiadne športové záznamy

# list.filter.picker
source: Filter
cs: Filtr

# list.loadError.message
source: Something went wrong reaching your data.
cs: Při načítání dat došlo k chybě.
sk: Pri načítaní údajov došlo k chybe.

# list.loadError.title
source: Couldn't Load Records
cs: Nepodařilo se načíst záznamy
sk: Nepodarilo sa načítať záznamy

# list.title
source: Sport Records
cs: Sportovní záznamy
sk: Športové záznamy

# storageType.local
source: Local
cs: Lokální
sk: Lokálne

# storageType.remote
source: Remote
cs: Vzdálené
sk: Vzdialené
